app/controllers/authentications_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "sarah@sarah.com"], ["password_digest", "$2a$10$liFW7AbrHNAM6gJTm9z08.kUCJApkyeE5np8TI7GMMDMSC1k95/n2"], ["created_at", 2017-02-16 12:39:45 UTC], ["updated_at", 2017-02-16 12:39:45 UTC]]
---
  def register
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "client2@client.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by_email(params[:email])