app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @rooms = Room.all

INSERT INTO "rooms" ("name", "user_id", "created_at", "updated_at", "playlist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "the best room evaaaa"], ["user_id", 1], ["created_at", 2017-02-21 21:15:15 UTC], ["updated_at", 2017-02-21 21:15:15 UTC], ["playlist_id", "16bBVFlKSGeUQmvCka4NEa"]]
---
  def create
    @room = Room.new(room_params)

    if @room.save

UPDATE "rooms" SET "name" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["name", "trial room updated"], ["updated_at", 2017-02-21 11:48:18 UTC], ["id", 1]]
---
  def update
    if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 1]]
---
  def destroy
    @room.destroy

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_room
      @room = Room.find(params[:id])